const langLib = {
  en: {
    ordinal: {
      1: 'перший',
      2: 'другий',
      3: 'третій',
      4: 'четвертий',
      5: "п'ятий",
      6: 'шостий',
      7: 'сьомий',
      8: 'восьмий',
      9: "дев'ятий",
      10: 'десятий',
    },
    cardinal: {},
  },
  uk: {
    ordinal: {
      1: 'перший',
      2: 'другий',
      3: 'третій',
      4: 'четвертий',
      5: "п'ятий",
      6: 'шостий',
      7: 'сьомий',
      8: 'восьмий',
      9: "дев'ятий",
      10: 'десятий',
    },
    cardinal: {},
  },
  de: {},
};

export default langLib;

// ones
// tens
// hundreds
