const UK = {
  0: ['', ''],
  1: ['перший', 'один'], // одна
  2: ['другий', 'два'], //дві
  3: ['третій', 'три'], 
  4: ['четвертий', 'чотири'],
  5: ["п'ятий", "п'ять"],
  6: ['шостий', 'шість'],
  7: ['сьомий', 'сім'],
  8: ['восьмий', 'вісім'],
  9: ["дев'ятий", "дев'ять"],
  10: ['десятий', 'десять'],
  11: ['одинадцятий', 'одинадцять'],
  12: ['дванадцятий', 'дванадцять'],
  13: ['тринадцятий', 'тринадцять'],
  14: ['чотирнадцятий', 'чотирнадцять'],
  15: ["п'ятнадцятий", "п’ятнадцять"],
  16: ['шістнадцятий', 'шістнадцять'],
  17: ['сімнадцятий', 'сімнадцять'],
  18: ['вісімнадцятий', 'вісімнадцять'],
  19: ["дев'ятнадцятий", "дев’ятнадцять"],
  20: ['двадцятий', 'двадцять'],
  30: ['тридцятий', 'тридцять'],
  40: ['сороковий', 'сорок'],
  50: ["п'ятдесятий", "п’ятдесят"],
  60: ['шістдесятий', 'шістдесят'],
  70: ['сімдесятий', 'сімдесят'],
  80: ['вісімдесятий', 'вісімдесят'],
  90: ["дев'яностий", "дев'яносто"],
  100: ['сотий', 'сто'], // '' + сотий
  200: ['двохсотий', 'двісті'], // двох + сотий + тисячний мільйонний ...
  300: ['трьохсотий', 'триста'],
  400: ['чотирьохсотий', 'чотириста'],
  500: ["п'ятисотий", "п’ятсот"],
  600: ['шестисотий', 'шістсот'],
  700: ['семисотий', 'сімсот'],
  800: ['восьмисотий', 'вісімсот'],
  900: ["дев'ятисотий", "дев’ятсот"],
  levels: [
    ['', ''],
    ['тисячний', 'тисяча'],
    ['мільйонний', 'мільйон'],
    ['мільярдний', 'мільярд'],
    ['трильйонний', 'трильйон'],
  ],
};

// 2_000 двохтисячний
// дві тисячі
// три тисячі
// семитисячний сім тисяч 
// восьмитисячний вісім тисяч
// дев'ятитисячний 
// 10_000	десятитисячний
// 71_000 сімдесятиоднотисячний
// 72_000 сімдесятидвохтисячний
// 75_000 сімдесятип'ятитисячний
// 100_000 стотисячний
// 145_000 стосорокап'ятитисячний
// 145_001 сто сорок п'ять тисяч перший
// 145_101 сто сорок п'ять тисяч сто перший
// 808_039 вісімсот вісім тисяч тридцять дев'ятий
// 903_000 дев'ятсоттрьохтисячний
// 1_000_000 мільйонний
// 1_000_001 один мільйон перший
// 3_000_000 трьохмільйонний
// 3_000_001 три мільйони перший
// 4_000_100 чотири мільйони сотий
// 4_002_000 чотири мільйони двохтисячний

// first splice cardinal array and then concat ordinal array and spread to result




export default UK;
/*



test('', , 'UK');
test('', , 'UK');
test("дев'ять мільйонів тридцятидвохтисячний", 9_032_000, 'UK');
test("п'ять мільйонів десятий", 5_000_010, 'UK');
test('сім мільйонів десятий', 7_000_010, 'UK');
test('вісім мільйонів двадцять тисяч одинадцятий', 8_020_011, 'UK');
test('чотири мільйони сотий', 4_000_100, 'UK');
test('стомільйонний', 100_000_000, 'UK');
test('сто мільйонів чотирьохтисячний', 100_004_000, 'UK');
test('мільярдний', 1_000_000_000, 'UK');
test('один мільярд двадцятий', 1_000_000_020, 'UK');
test('трильйонний', 1_000_000_000_000, 'UK');
*/
