const UK = {
  0: ['', ''],
  1: ['перший', 'один'],
  2: ['другий', 'two'],
  3: ['третій', 'три'],
  4: ['четвертий', 'чотири'],
  5: ["п'ятий", "п'ять"],
  6: ['шостий', 'six'],
  7: ['сьомий', 'сім'],
  8: ['восьмий', 'вісім'],
  9: ["дев'ятий", 'nine'],
  10: ['десятий', 'ten'],
  11: ['одинадцятий', 'eleven'],
  12: ['twelfth', 'twelve'],
  13: ['thirteenth', 'thirteen'],
  14: ['чотирнадцятий', 'fourteen'],
  15: ["п'ятнадцятий", 'fifteen'],
  16: ['sixteenth', 'sixteen'],
  17: ['seventeenth', 'seventeen'],
  18: ['eighteenth', 'eighteen'],
  19: ['nineteenth', 'nineteen'],
  20: ['двадцятий', 'двадцять'],
  30: ['тридцятий', 'thirty'],
  40: ['сороковий', 'сорок'],
  50: ['fiftieth', 'fifty'],
  60: ['sixtieth', 'sixty'],
  70: ['seventieth', 'seventy'],
  80: ['eightieth', 'eighty'],
  90: ["дев'яностий", 'ninety'],
  100: ['сотий', 'сто'],
  levels: [
    ['', ''],
    ['тисячний', 'thousand'],
    ['мільйонний', 'мільйон'],
    ['мільярдний', 'мільярд'],
    ['трильйонний', 'трильйон'],
  ],
};

// 10 000	десятитисячний


export default UK;
/*



test('двадцять перший', 21, 'UK');
test("двадцять п'ятий", 25, 'UK');
test('тридцятий', 30, 'UK');
test('сорок восьмий', 48, 'UK');
test("дев'яностий", 90, 'UK');
test('сотий', 100, 'UK');
test('сто перший', 101, 'UK');
test('сто двадцятий', 120, 'UK');
test('сто двадцять четвертий', 124, 'UK');
test('двісті двадцять четвертий', 224, 'UK');
test('двісті сороковий', 240, 'UK');
test('чотирьохсотий', 400, 'UK');
test('чотириста третій', 403, 'UK');
test("чотириста дев'яносто перший", 491, 'UK');
test("п'ятисотий", 500, 'UK');
test('тисячний', 1_000, 'UK');
test('двохтисячний', 2_000, 'UK');
test('дві тисячі перший', 2_001, 'UK');
test('дві тисячі чотирнадцятий', 2_014, 'UK');
test('три тисячі семисотий', 3_700, 'UK');
test('вісім тисяч сотий', 8_100, 'UK');
test('десятитисячний', 10_000, 'UK');
test('сімдесятиоднотисячний', 71_000, 'UK');
test('сімдесятидвохтисячний', 72_000, 'UK');
test("сімдесятип'ятитисячний", 75_000, 'UK');
test('стотисячний', 100_000, 'UK');
test("стосорокап'ятитисячний", 145_000, 'UK');
test("сто сорок п'ять тисяч перший", 145_001, 'UK');
test("сто сорок п'ять тисяч сто перший", 145_101, 'UK');
test("вісімсот вісім тисяч тридцять дев'ятий", 808_039, 'UK');
test("дев'ятсоттрьохтисячний", 903_000, 'UK');
test('мільйонний', 1_000_000, 'UK');
test('один мільйон перший', 1_000_001, 'UK');
test('трьохмільйонний', 3_000_000, 'UK');
test('три мільйони перший', 3_000_001, 'UK');
test('чотири мільйони сотий', 4_000_100, 'UK');
test('чотири мільйони двохтисячний', 4_002_000, 'UK');
test("дев'ять мільйонів тридцятидвохтисячний", 9_032_000, 'UK');
test("п'ять мільйонів десятий", 5_000_010, 'UK');
test('сім мільйонів десятий', 7_000_010, 'UK');
test('вісім мільйонів двадцять тисяч одинадцятий', 8_020_011, 'UK');
test('чотири мільйони сотий', 4_000_100, 'UK');
test('стомільйонний', 100_000_000, 'UK');
test('сто мільйонів чотирьохтисячний', 100_004_000, 'UK');
test('мільярдний', 1_000_000_000, 'UK');
test('один мільярд двадцятий', 1_000_000_020, 'UK');
test('трильйонний', 1_000_000_000_000, 'UK');
*/
